Revit 2026 API
MassSurfaceData.SillHeight Property
 The height above the level where the bottoms of auto-generated windows will be located.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public double SillHeight { get; set; }
Public Property SillHeight As Double
	Get
	Set
public:
property double SillHeight {
	double get ();
	void set (double value);
}
member SillHeight : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The sill height is less than zero.
Remarks
 Will be accurate unless the target glazing percentage cannot be achieved using this height. In that case, the sillHeight will be ignored and windows will be created below this height.
See Also
Reference
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace